# Useful Pandas Snippets

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

## Importing Data

Read from CSV file

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Creating Data

Using dataframe

In [4]:
pd.DataFrame({'Name':['Marie', 'John', 'Max', 'Jane'],
              'Age':[32, 28, 27, 33]}, 
             index=['rank1','rank2','rank3','rank4'])

       Age   Name
rank1   32  Marie
rank2   28   John
rank3   27    Max
rank4   33   Jane

In [5]:
pd.DataFrame(np.random.randint(low=0, high=100, size=(5, 5)), 
             columns=['A', 'B', 'C', 'D', 'E'])

    A   B   C   D   E
0   6  13  68  17  20
1   1  46  92   5  32
2  63  26  14  53  81
3  19  49  15  52  70
4  93  26  18  81  23

Using list comprehension

In [6]:
list = [x**2 for x in range(10)]

In [7]:
[x for x in list if x % 2 == 0]

[0, 4, 16, 36, 64]

## Cleaning

Drop NaN in fare

In [8]:
df.dropna(subset=["Fare"], inplace=True)

Return null values

In [9]:
df[df['Fare'].isnull()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

Upper case all column names

In [10]:
df.columns = map(str.upper, df.columns)

Rename columns

In [11]:
df = df.rename(columns = {
    'Pclass':'Class',
    'Name':'Full Name',
})

Alternatively

In [12]:
df.columns = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L']
df.columns = ['Id', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard', 
              'Parents/Children Aboard', 'Ticket', 'Fare', 'Cabin', 'Embarked']

Filter columns containing "Aboard"

In [13]:
df_aboard = df.loc[:, df.columns[df.columns.str.contains('Aboard')].tolist()]

In [14]:
df_aboard.head()

   Siblings/Spouses Aboard  Parents/Children Aboard
0                        1                        0
1                        1                        0
2                        0                        0
3                        1                        0
4                        0                        0

Replace strings in column

In [15]:
df['Sex'] = df['Sex'].str.replace('Mr.', 'Mister')

Remove if contains character

In [16]:
# files = [file for file in files if "~" not in file]

Remove based on multiple values

In [17]:
df = df[~df['Name'].isin(['Invalid', 'Unknown'])]

Change type

In [18]:
df['Fare'] = df['Fare'].astype(float)

Reset index

In [19]:
df.reset_index(drop=True, inplace=True)

Convert to lower case

In [20]:
df['Sex'] = df['Sex'].str.lower()

Converting datas

In [21]:
# pd.to_datetime(d["colA"]).dt.strftime('%b-%y')

Deleting columns

In [22]:
del df['Siblings/Spouses Aboard']
del df['Parents/Children Aboard']

## Exploring

Number of rows

In [23]:
len(df.index)

891

Get info

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
Id          891 non-null int64
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
Ticket      891 non-null object
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null object
dtypes: float64(2), int64(3), object(5)
memory usage: 69.7+ KB

Describe data

In [25]:
df.describe()

               Id    Survived      Pclass         Age        Fare
count  891.000000  891.000000  891.000000  714.000000  891.000000
mean   446.000000    0.383838    2.308642   29.699118   32.204208
std    257.353842    0.486592    0.836071   14.526497   49.693429
min      1.000000    0.000000    1.000000    0.420000    0.000000
25%    223.500000    0.000000    2.000000   20.125000    7.910400
50%    446.000000    0.000000    3.000000   28.000000   14.454200
75%    668.500000    1.000000    3.000000   38.000000   31.000000
max    891.000000    1.000000    3.000000   80.000000  512.329200

Select two columns

In [26]:
df[['Name', 'Fare']].head()

                                                Name     Fare
0                            Braund, Mr. Owen Harris   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  71.2833
2                             Heikkinen, Miss. Laina   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  53.1000
4                           Allen, Mr. William Henry   8.0500

Get titles

In [27]:
df["Title"] = df["Name"].str.split(" ").str[0]

Looking only at males

In [28]:
df[df['Sex'] == 'male'].head()

,Id,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,"Braund,"
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,"Allen,"
5,6,0,3,"Moran, Mr. James",male,NaN,330877,8.4583,NaN,Q,"Moran,"
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,17463,51.8625,E46,S,"McCarthy,"
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,349909,21.0750,NaN,S,"Palsson,"

Looking only at males who survived

In [29]:
df[(df['Sex'] == 'male') & (df['Survived'] == 1)].head()

,Id,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Title
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,244373,13.0000,NaN,S,"Williams,"
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,248698,13.0000,D56,S,"Beesley,"
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,113788,35.5000,A6,S,"Sloper,"
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,2677,7.2292,NaN,C,"Mamee,"
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,19947,35.5000,C52,S,"Woolner,"

Looking only at males who survived above the age of 50

In [30]:
df[(df['Sex'] == 'male') & (df['Survived'] == 1) & (df['Age'] > 50)].head()

,Id,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Title
449,450,1,1,"Peuchen, Major. Arthur Godfrey",male,52.0,113786,30.5,C104,S,"Peuchen,"
570,571,1,2,"Harris, Mr. George",male,62.0,S.W./PP 752,10.5,NaN,S,"Harris,"
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.0,13567,79.2,B41,C,"Frolicher-Stehli,"
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,27042,30.0,A23,S,"Barkworth,"
647,648,1,1,"Simonius-Blumer, Col. Oberst Alfons",male,56.0,13213,35.5,A26,C,"Simonius-Blumer,"

Set column value based on other columns

In [31]:
df['Note'] = np.nan

In [32]:
df.loc[(df['Sex'] == 'male') & (df['Survived'] == 1) & (df['Age'] > 50), 
       ['Note']] = 'Male Above 50 Survived'

In [33]:
df['Note'].sort_values()[:3]

449    Male Above 50 Survived
570    Male Above 50 Survived
587    Male Above 50 Survived
Name: Note, dtype: object

Number of men who survived

In [34]:
len(df[(df['Sex'] == 'male') & (df['Survived'] == 1)])

109

Average age of men who survived

In [35]:
df[(df['Sex'] == 'male') & (df['Survived'] == 1)]['Age'].mean()

27.276021505376345

Filter by multiple values

In [36]:
df[df["Name"].isin(["Mr. Charles Eugene Williams", "Mr. Lawrence Beesley"])]

Empty DataFrame
Columns: [Id, Survived, Pclass, Name, Sex, Age, Ticket, Fare, Cabin, Embarked, Title, Note]
Index: []

Highest fare paid

In [37]:
df.loc[df['Fare'].idxmax()]

Id                       259
Survived                   1
Pclass                     1
Name        Ward, Miss. Anna
Sex                   female
Age                       35
Ticket              PC 17755
Fare                 512.329
Cabin                    NaN
Embarked                   C
Title                  Ward,
Note                     NaN
Name: 258, dtype: object

Sorting

In [38]:
df.sort_values(['Fare', 'Age'], ascending=[0,1]).head()

,Id,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Title,Note
258,259,1,1,"Ward, Miss. Anna",female,35.0,PC 17755,512.3292,NaN,C,"Ward,",NaN
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,PC 17755,512.3292,B101,C,"Lesurer,",NaN
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,PC 17755,512.3292,B51 B53 B55,C,"Cardeza,",NaN
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,19950,263.0000,C23 C25 C27,S,"Fortune,",NaN
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,19950,263.0000,C23 C25 C27,S,"Fortune,",NaN

Sort by multiple columns

In [39]:
df.sort_values(['Fare', 'Age'], ascending=[0,1]).head()

,Id,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Title,Note
258,259,1,1,"Ward, Miss. Anna",female,35.0,PC 17755,512.3292,NaN,C,"Ward,",NaN
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,PC 17755,512.3292,B101,C,"Lesurer,",NaN
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,PC 17755,512.3292,B51 B53 B55,C,"Cardeza,",NaN
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,19950,263.0000,C23 C25 C27,S,"Fortune,",NaN
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,19950,263.0000,C23 C25 C27,S,"Fortune,",NaN

Number of classes

In [40]:
df['Pclass'].unique()

array([3, 1, 2])

Count of each class

In [41]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

Find duplicates

In [42]:
df[df.duplicated(['Name'], keep=False)]

Empty DataFrame
Columns: [Id, Survived, Pclass, Name, Sex, Age, Ticket, Fare, Cabin, Embarked, Title, Note]
Index: []

## Looping

In [43]:
for index, row in df.iterrows():
    continue
#     print(index)
#     print(row)

Returning tuples

In [44]:
for row in df.itertuples():
    continue
#     print(row)

## Grouping

Group by class and aggregate fare by mean

In [45]:
df.groupby(['Pclass'])['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

Pivot table

In [46]:
pd.pivot_table(df, values='Fare', index='Pclass', columns='Sex', 
               aggfunc=np.mean)

Sex         female       male
Pclass
1       106.125798  67.226127
2        21.970121  19.741782
3        16.118810  12.661633

Sample weighted average aggregation function

In [47]:
agg_func = {'colA': ['sum'], 
            'colB': lambda x: np.average(x, weights=d.loc[x.index, 'colC'])}

## Miscellaneous

Functions in dictionary

In [48]:
func = {
    'times2': lambda x: print("The solution is: {}".format(x**2)),
    'times3': lambda x: print("The solution is: {}".format(x**3)),
    'times4': lambda x: print("The solution is: {}".format(x**4))
}

In [49]:
func['times2'](3)

The solution is: 9

## Recommended Cheat Sheets

* [Pandas DataFrame Object](http://www.webpages.uidaho.edu/~stevel/504/Pandas%20DataFrame%20Notes.pdf) from University of Idaho
* [Data Wrangling with Pandas](http://cs.umw.edu/~stephen/cpsc219/Pandas_Cheat_Sheet.pdf) from University of Mary Washington
* [Python for Data Science Pandas Basics](http://datacamp-community.s3.amazonaws.com/3857975e-e12f-406a-b3e8-7d627217e952) from DataCamp
* [Data Science Python Intermediate](https://www.dataquest.io/blog/large_files/python-cheat-sheet-intermediate.pdf) from Dataquest
* [Data Science Numpy](https://www.dataquest.io/blog/large_files/numpy-cheat-sheet.pdf) from Dataquest
* [Data Science Pandas](https://www.dataquest.io/blog/large_files/pandas-cheat-sheet.pdf) from Dataquest